# PipeFrictionFactorService Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ExternalServices..::..BuiltInExternalServices..::..PipeFrictionFactorService Property
ExternalServices..::..BuiltInExternalServices Class See Also
---
Pipe friction factor service id
**Namespace:** Autodesk.Revit.DB.ExternalService**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ExternalServiceId PipeFrictionFactorService { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property PipeFrictionFactorService As ExternalServiceId
	Get
```

Visual C++
---
```text
public:
static property ExternalServiceId^ PipeFrictionFactorService {
	ExternalServiceId^ get ();
}
```

# See Also
ExternalServices..::..BuiltInExternalServices Class
Autodesk.Revit.DB.ExternalService Namespace